Revit 2024 API
Path3d.CurveLoop Property
Get the Curve Loop of Path3d via index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArray this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property CurveLoop ( _
	index As Integer _
) As CurveArray
	Get
Visual C++
public:
property CurveArray^ CurveLoop[int index] {
	CurveArray^ get (int index);
}
Parameters
index
Type: System.Int32
Remarks
Returns the index order Curve Loop of Path3d.
See Also
Path3d Class
Autodesk.Revit.DB Namespace